[
    {
        "title": "My Time in Sales",
        "description": "While not part of the original plan, my time in sales taught me a lot.",
        "headerImage": "./assets/images/aIMG_2302.jpg",
        "publishDate": "February 15, 2023",
        "content": "For as long as I can remember, my mother was in sales. I never found any interest in the topic and had a general aversion to “salespeople”. Never would have considered it something I would have done professionally. Then how did I end up as an outside sales rep at a software development company shortly after college? I would be lying if I said that at that time it was a strategic decision in order to set myself up for success in my career. Even though the experience was more of a leap of faith than a meticulously planned chess move in my career, I learned a lot during my time in sales at Omnitech. I am positive I would not be where I am now if it wasn’t for the experience. I know sales is not something many people want to read about, but to those people I say: “just give this post a quick read, you might find some little nuggets of info”. Here are some of the most valuable lessons I learned during my time in sales at Omnitech.\nRelationships are important. This goes for sales, management, family, community, and life in general. You want to surround yourself with people you like to be around. You can take this a step further by saying that you want to buy from people you like. Building relationships is how you lead a successful team, and trust is built through those relationships. I am not going to buy something from someone unless I can trust the person selling it. In my opinion, this is the golden rule for salespeople. Building a relationship takes time and when things go bad (which eventually something will go bad), the solid relationships are the ones that last. A solid relationship doesn’t happen overnight, you have to invest time and energy into it. I strongly recommend everyone read the incredibly popular book “How to Win Friends and Influence People” by Dale Carnegie to improve your relationship building prowess. This lesson helped me so much in my career, because I knew I had to build relationships with my boss, my team members, and coworkers. That’s when you can really get shit done, when you have a solid team in which the team members have relationships built on trust amongst each other.\nGoing to add a sub item here to mention that having a solid relationship with your coworkers can greatly improve your work experience as well, so be sure to invest some time into them!\nSales (revenue) is what drives business. This may seem a bit obvious, but unless you have money coming in the door, you don’t have a successful business. Someone will argue that you can have a successful business that makes no money, many tech startups operate this way by taking outside investments or going public. However, I would not take this approach because if you do not have sales, you don’t know if anyone actually values what you are providing. If you think you have the best product in the world, but no one is going to spend their money on it, then your product might not be such hot shit... \nNo matter what a person’s title or what company they work for, at the end of the day, they are still just a person. This is not meant to devalue anyone, but rather help people understand that even the CEO of a massive corporation is still just a human. They have personal issues they are working through just like everyone else. As my sales manager at Omnitech use to tell me, “Everyone puts their pants on the same way: one leg at a time.” This idea gave me the confidence to cold call people and want to provide value to them. With this concept in mind, many of the most successful people are a lot less intimidating. So, invite that person you look up to out for coffee or lunch. The worst thing they can say is “no”, but I have often found that people are more willing to mentor others than we think. You could have a life changing experience because you took a chance to talk with an influential person. Even if they do say “no”, you can ask someone else, which brings us to the next point... \nYou are going to hear “no” a lot in life, and that is okay. I really struggled with this when I started in sales. Not only was I a more introverted person that didn’t always want to talk with others, but after the 100th time someone tells you they don’t want to talk to you, there were times I did not want to do it anymore. I believe it is the person that can hear the word “no” the most in life and keep moving forward that will be the most successful. You didn’t get a job offer at that company you wanted to work for? That’s okay. Learn something from it, implement some changes for next time, and apply for another job!\nAt the end of the day, sales is not for everyone. I am not suggesting that everyone go out and get a sales job ASAP. But the experience certainly opened my eyes to the way professional and business life operates. So go ahead and take chances by meeting with a mentor of yours, learn how your business actually sells and makes money, build a stronger relationship with your boss, and if you are looking to start your own business, make sure you are building something that people will actually buy! \nI want to close with a special shout out to the leaders at Omnitech for taking a chance on me. They took in a fresh graduate with no experience on a whim that he might be able to provide value to the company. I learned a lot from them and I thank them for the opportunity!"
    },
    {
        "title": "My Journey to Software Developer",
        "description": "While not part of the original plan, my time in sales taught me a lot.",
        "headerImage": "./assets/images/Picture6.jpg",
        "publishDate": "December 28, 2022",
        "content": "My path to software development has not necessarily been the most strait of lines. It has been a ride, one which I pray marches forward as well as it has. I wanted to share my career journey to this point and some lessons along the way. Not only is this a narrative for self-reflection, but I hope a lesson that can inspire others in their journeys.\nTo keep this post from turning into a novel, I would like to look at my career thus far on how programming has left a consistent impact on my career progression.\nCollege\nCollege was certainly a time period of significant change. Beyond the obvious changes that come with moving away from parents for the first time, there is a major life decision that needs to be made: “what do I want to do for the rest of my life?” This was a difficult one for me... I knew a little about computers, but nothing beyond a high school class on Excel and Photoshop. But what I did know, I found interesting enough to declare a computer science and business major at Augustana University, Augustana College back in my day! Computer Science classes were difficult, but I found that rush that many come to find when building software. That hit of dopamine when you finally get a code to compile, followed by the immediate brick wall when the output is not what you expected. This constant tennis match of success and failure was something I had not quite experienced before.\nThroughout my time at Augie, I continued forward with programming classes, even though I eventually dropped the computer science major for a computer information systems major. The primary reason being, ashamedly, that I found computer science III’s difficulty greater than the effort I was willing to put into it. At the same time, I found marketing interesting and decided I wanted to go more into that direction. Who knows how this decision would have impacted where I am today, but it is something I think about from time to time. Even the thought of returning to college to finally get the CS degree has not been completely ruled out.\nEarly Career\nUpon graduation from college, I started my career at a local advertising agency called Lawrence and Schiller. I interned as a Digital Strategist, which mostly consisted of project management type work for website design and development. I found myself more interested in the development side of work than the actual marketing side during my 9 months with the agency. I wanted to learn more from the developers I was working with. I would often shadow them in order to see what programming in the “real world” looked like.\nAfter the internship, I moved to a software development organization called Omnitech. I learned a lot during my time in sales at Omnitech. I learned a lot about technology, business, people, and myself. I could write a lot about some of the things I learned at Omnitech, possibly another post coming soon. To keep things focused, I found myself gravitating to the developers of Omnitech and asking them questions about technology and the things they were working on. The tug of programming was still there.\nGaining Steam\nZuercher Technologies was the place to work in Sioux Falls if you wanted to work in tech, at least that is how I saw it. The founder, Michael Zuercher, was someone who had piqued my interest for years. The company that he built was fascinating to me, as a person who loved learning about both technology and entrepreneurship. After applying for several positions with the company, all of which ended in a “no”, I was given a shot by a great data conversion manager, Mike Oppelt. As a data conversion analyst, it was my job to shape the data from a public safety agency’s legacy software system into a format that would work with their new Zuercher software. Instead of making sales calls and working with people, my job was writing SQL and working with databases. This was my real taste of professional technical work. Since I was very much on an island of sorts because of the product I was working on, I was given a lot of flexibility to make the process my own, including working with Python to build tools and scripts to make our conversions faster and better. That programming tug was in full force here as I found that this scripting and tool development was my favorite part of the job.\nOver a year into my time at Zuercher, the company merged with another public safety software provider and we became CentralSquare Technologies (CST). That same manager that brought me on as a data conversion analyst asked me to be manager of a data conversion team. Business and leadership was something I had wanted since college, and my chance had come. Honestly, this was faster than I had originally thought, but I was ready for the challenge. I had a great team of data conversion professionals and we did great work during my time as a manager. I learned even more during this time because of the quality of my team and leaders I worked with every day. However, that programmer tug would not go away so easily.\n2 years of management passed, and I was ready to get into the development space. But, I didn’t exactly take the next step most people would think to take. Instead of transferring into a developer role at CentralSquare, I transferred into a manager of a development team. I learned more during those first few months than I ever had. I needed to write down words and phrases as they were stated during meetings, so I could go back later and find out what was being said. At one point I had over 150 terms and phrases that I had researched. I learned so much during my time managing the team of developers, but there was still something I needed to do. I needed to prove that I could be a competent developer, with my hands actually building the software.\nDuring my time as a manger, I was fortunate enough to be able take a few user stories (work items) from time to time and put my self-taught learning to professional practice. I am convinced that these efforts are what brought me to even have a chance at getting into FTI, where I currently work. Since I had worked in Angular at CST and FTI needed an Angular developer, I got lucky. Luck certainly played a role in a lot of my past experiences, but even more so, it was from the people who took a chance on me. I am very grateful for those who took a chance on someone with little or no experience in the field I was applying for!\nFinal Thoughts\nAs mentioned at the beginning, this career journey hasn’t been the stereotypical linear one. The interesting bit across the entire journey has been that programming has popped up throughout each step along the way. I continued to learn more about programming in my spare time at each and every step. Codecademy, Pluralsight, YouTube, books, and GitHub are all great resources for those who want to get into programming. You do not need a special degree or a bootcamp, as long as you have the discipline to put in the effort. Having said that, you also need the hunger to learn and the willingness to get knocked down. A mentor of mine recently stated that you will certainly be successful if you continue to strive towards topics that interest you, shout out to Jeff Beard! This statement connects with me the longer I think about it. To be good at something, you have to put the work in. In order to put the work in, you have to have some desire to want to learn more about it, otherwise, you will certainly burn out. Pure willpower can only get you so far. That does not mean that things won’t suck sometimes, every job/position/role has some shitty parts... but if you can get through the shitty parts, you know you found something special.\nAs for me, I am not completely sure what the next career step looks like (for the first time in a long time). There is a good chance that I get into management/leadership again, since I enjoy learning more about those topics. On the other hand, I like being in that “flow” state of development. Stay tuned and stay determined!"
    }
]